In [1]:
import pandas as pd
import numpy as np

In [4]:
a={
    'USN':[100,101,102],
    'Name':['Dinesh', 'Anubhuti', 'Kamlesh'],
    'Mobile':[97,98,99]
}

In [5]:
std=pd.DataFrame(a)

In [6]:
std

   USN      Name  Mobile
0  100    Dinesh      97
1  101  Anubhuti      98
2  102   Kamlesh      99

In [7]:
std.columns

Index(['USN', 'Name', 'Mobile'], dtype='object')

In [8]:
std.head(1)

   USN    Name  Mobile
0  100  Dinesh      97

In [10]:
std.loc[2]

USN           102
Name      Kamlesh
Mobile         99
Name: 2, dtype: object

In [14]:
std.iloc[[1,2]]

   USN      Name  Mobile
1  101  Anubhuti      98
2  102   Kamlesh      99

In [15]:
std.isnull()

     USN   Name  Mobile
0  False  False   False
1  False  False   False
2  False  False   False

In [16]:
std.shape

(3, 3)

In [17]:
std.size

9

In [21]:
df=std.copy()

In [22]:
df['Marks']=[100,90,80]

In [23]:
df

   USN      Name  Mobile  Marks
0  100    Dinesh      97    100
1  101  Anubhuti      98     90
2  102   Kamlesh      99     80

In [24]:
#Create a DataFrame Cars having the attributes CarID, CarName(5 values)

In [25]:
b={'CarID':[101,102,103,104,105],
   'CarName':['Ford','Honda','Mustang','Toyota','Tesla']
  }

In [26]:
Cars=pd.DataFrame(b)

In [27]:
Cars

   CarID  CarName
0    101     Ford
1    102    Honda
2    103  Mustang
3    104   Toyota
4    105    Tesla

In [28]:
Cars.columns

Index(['CarID', 'CarName'], dtype='object')

In [30]:
Cars1=pd.DataFrame()
Cars1['CarID']=Cars['CarID']

In [31]:
Cars1

   CarID
0    101
1    102
2    103
3    104
4    105

In [34]:
Cars1['CarName']=[None,None,None,None,None]

In [35]:
Cars1

   CarID CarName
0    101    None
1    102    None
2    103    None
3    104    None
4    105    None

In [36]:
Cars1.isnull()

   CarID  CarName
0  False     True
1  False     True
2  False     True
3  False     True
4  False     True

In [52]:
index=pd.Index(['A','B','C','D','E'])
Cars1.set_index(index)

   CarID CarName
A    101    None
B    102    None
C    103    None
D    104    None
E    105    None

In [44]:
df1=df['Marks']<90 #returns the boolean value

In [49]:
df[df1][['Name','USN']]

      Name  USN
2  Kamlesh  102

In [56]:
df[(df['USN']<100) | (df['Marks']>90)] # | is used for OR, & is used for AND

   USN    Name  Mobile  Marks
0  100  Dinesh      97    100

In [64]:
df.drop('Name',axis=1, inplace=True)

In [66]:
df

   USN  Mobile  Marks
0  100      97    100
1  101      98     90
2  102      99     80

In [70]:
df2=df.drop(2)

In [72]:
df2

   USN  Mobile  Marks
0  100      97    100
1  101      98     90

In [73]:
print(df2)

   USN  Mobile  Marks
0  100      97    100
1  101      98     90